{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "<S>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "</S>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "<|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 5,
      "special": true,
      "content": "<NONE>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 6,
      "special": true,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 7,
      "special": true,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 8,
      "special": true,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<S>": 2,
      "</S>": 3,
      "<|>": 4,
      "<NONE>": 5,
      "<bos>": 6,
      "<eos>": 7,
      "<sep>": 8,
      ";": 9,
      "+": 10,
      ":": 11,
      ",": 12,
      "raw": 13,
      "on": 14,
      "open": 15,
      "nothing": 16,
      "to": 17,
      "---": 18,
      "in": 19,
      "red": 20,
      "unknown": 21,
      "pepper": 22,
      "door": 23,
      "]<<<": 24,
      "-=": 25,
      ">>>[": 26,
      "=-": 27,
      ".": 28,
      "you": 29,
      "potato": 30,
      "carrying": 31,
      "exits": 32,
      "kitchen": 33,
      "oven": 34,
      "cookbook": 35,
      "the": 36,
      "fridge": 37,
      "knife": 38,
      "table": 39,
      "counter": 40,
      "yellow": 41,
      "stove": 42,
      "east": 43,
      "north": 44,
      "west": 45,
      "south": 46,
      "go": 47,
      "onion": 48,
      "bell": 49,
      "closed": 50,
      "meal": 51,
      "hot": 52,
      "apple": 53,
      "patio": 54,
      "chicken": 55,
      "fried": 56,
      "floor": 57,
      "white": 58,
      "corridor": 59,
      "roasted": 60,
      "glass": 61,
      "take": 62,
      "purple": 63,
      "livingroom": 64,
      "plain": 65,
      "chop": 66,
      "-": 67,
      "frosted": 68,
      "sliced": 69,
      "orange": 70,
      "diced": 71,
      "banana": 72,
      "cheese": 73,
      "of": 74,
      "block": 75,
      "pork": 76,
      "chopped": 77,
      "backyard": 78,
      "parsley": 79,
      "carrot": 80,
      "grilled": 81,
      "---------": 82,
      "read": 83,
      "eat": 84,
      "prepare": 85,
      "cilantro": 86,
      "water": 87,
      "drop": 88,
      "leg": 89,
      "pantry": 90,
      "wing": 91,
      "from": 92,
      "black": 93,
      "ground": 94,
      "sliding": 95,
      "do": 96,
      "screen": 97,
      "with": 98,
      "bedroom": 99,
      "salt": 100,
      "oil": 101,
      "bbq": 102,
      "garden": 103,
      "olive": 104,
      "slice": 105,
      "flour": 106,
      "recipe": 107,
      "find": 108,
      "acquire": 109,
      "start": 110,
      "dice": 111,
      "bathroom": 112,
      "chair": 113,
      "driveway": 114,
      "a": 115,
      "many": 116,
      "too": 117,
      "re": 118,
      "'": 119,
      "things": 120,
      "already": 121,
      "green": 122,
      "tuna": 123,
      "street": 124,
      "up": 125,
      "pick": 126,
      "shelf": 127,
      "barn": 128,
      "wooden": 129,
      "shed": 130,
      "cook": 131,
      "sofa": 132,
      "fry": 133,
      "roast": 134,
      "front": 135,
      "fiberglass": 136,
      "supermarket": 137,
      "egg": 138,
      "tomato": 139,
      "bed": 140,
      "milk": 141,
      "commercial": 142,
      "revealing": 143,
      "toolbox": 144,
      "showcase": 145,
      "toilet": 146,
      "grill": 147,
      "and": 148,
      "workbench": 149,
      "breast": 150,
      "sugar": 151,
      "lettuce": 152,
      "some": 153,
      "an": 154,
      "vegetable": 155,
      "peanut": 156
    },
    "unk_token": "<UNK>"
  }
}